//
//  main.c
//  9--特殊函数--demo
//
//  Created by YanTianFeng on 15-10-16.
//  Copyright (c) 2015年 qianfeng. All rights reserved.
//

#include <stdio.h>

//格式一
//函数声明
void func(void);
//函数定义
void func(void)//参数列表部分的 void,表示无参.
{
    
}

//格式二
//函数声明
void func2();
//函数定义
void func2()//函数调用时,可以传入无限多个参数(任意个数,任意类型)
{
    
}

int main(int argc, const char * argv[])
{
    //函数调用
    func();
    func2(1);
    func2(1,2);
    func2(1,2,3);
    func2(1,'a',3.14,1,'a',3.141,'a',3.14,'a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a','a',3.14,1,'a',3.141,'a');
    return 0;
}










